In [1]:
''' Q1 '''

' Q1 '

In [3]:
import pandas as pd
data =[ 3,4,5,6,78 ] 
ser = pd.Series(data)
print(ser)
type(ser)

0     3
1     4
2     5
3     6
4    78
dtype: int64

pandas.core.series.Series

In [4]:
''' Q2 '''

' Q2 '

In [5]:
import pandas as pd
mylist = ['g', 'e', 'e', 'k', 's',10,20,30,40 , [11,22,33,44,55]]
ser = pd.Series(mylist)
print(ser)

0                       g
1                       e
2                       e
3                       k
4                       s
5                      10
6                      20
7                      30
8                      40
9    [11, 22, 33, 44, 55]
dtype: object

In [6]:
''' Q3 '''

' Q3 '

In [7]:
import lxml
import pandas as pd

df = pd.read_csv("student.csv")
type(df)

pandas.core.frame.DataFrame

In [8]:
''' Q4 '''

' Q4 '

In [9]:
import pandas as pd

fruits = [ "apple" ,"orange" ,"jackfruit" ]
ftser1 = pd.Series(fruits, index=[11,33,88])
type(ftser1)
print(ftser1)
print("")
states = ["jammu" ,"maharastra", "bihar"]
stser1 = pd.Series(states)
type(states)
print(stser1)

11        apple
33       orange
88    jackfruit
dtype: object

0         jammu
1    maharastra
2         bihar
dtype: object

In [10]:
fruits_jack = ["apples", "oranges", "bananas"]
fruits_john = ["guavas", "kiwis", "strawberries"]

all_fruits = { "jack_fruit" : fruits_jack, 
               "john_fruit" : fruits_john  }

new_fruit = pd.DataFrame(all_fruits)
type(new_fruit)
print(new_fruit)

  jack_fruit    john_fruit
0     apples        guavas
1    oranges         kiwis
2    bananas  strawberries

In [11]:
''' Q5 '''

' Q5 '

In [12]:
import pandas as pd
import numpy as np
technologies   = {
    'Courses':["Spark","PySpark","Hadoop","Python","Pandas",None,"Spark","Python"],
    'Fee' :[22000,25000,23000,24000,np.nan,25000,25000,22000],
    'Duration':['30day','50days','55days','40days','60days','35day','','50days'],
    'Discount':[1000,2300,1000,1200,2500,1300,1400,1600]
          }
row_labels=['r0','r1','r2','r3','r4','r5','r6','r7']
#df = pd.DataFrame(technologies, index=row_labels)
df = pd.DataFrame(technologies)
print(df)
print(type(df))
df['Discount'] = df['Discount'] - 500
df
df2 = df[6:]
df2
df.drop(df.index[2:])
df1=df.drop(0)
df1

   Courses      Fee Duration  Discount
0    Spark  22000.0    30day      1000
1  PySpark  25000.0   50days      2300
2   Hadoop  23000.0   55days      1000
3   Python  24000.0   40days      1200
4   Pandas      NaN   60days      2500
5     None  25000.0    35day      1300
6    Spark  25000.0               1400
7   Python  22000.0   50days      1600
<class 'pandas.core.frame.DataFrame'>

   Courses      Fee Duration  Discount
1  PySpark  25000.0   50days      1800
2   Hadoop  23000.0   55days       500
3   Python  24000.0   40days       700
4   Pandas      NaN   60days      2000
5     None  25000.0    35day       800
6    Spark  25000.0                900
7   Python  22000.0   50days      1100

In [13]:
''' Q6 '''

' Q6 '

In [14]:
''' Q6
Pandas deals with the following three data structures −
	Series
	DataFrame
	Panel
Series 		:1 1D labeled homogeneous array, size immutable.
Data Frames	: 2 General 2D labeled, size-mutable tabular structure with potentially heterogeneously typed columns.
Panel		: 3 General 3D labeled, size-mutable array.
'''

' Q6\nPandas deals with the following three data structures −\n\tSeries\n\tDataFrame\n\tPanel\nSeries \t\t:1 1D labeled homogeneous array, size immutable.\nData Frames\t: 2 General 2D labeled, size-mutable tabular structure with potentially heterogeneously typed columns.\nPanel\t\t: 3 General 3D labeled, size-mutable array.\n'

In [15]:
''' Q7 '''

' Q7 '

In [16]:
import pandas as pd

courses = pd.Series(['Spark','PySpark','Hadoop'])
fees = pd.Series([22000,23000,24000])
discount = pd.Series([1000,2300,2400])

df = pd.concat([courses,fees,discount],axis=1)
df
type(df)

pandas.core.frame.DataFrame

In [17]:
''' Q1 
data =[ 3,4,5,6,78 ] 
ser = pd.Series(data)
print(ser)
type(ser)

'''

''' Q2
mylist = ['g', 'e', 'e', 'k', 's',10,20,30,40 , [11,22,33,44,55]]
ser = pd.Series(mylist)
print(ser)
'''

''' Q3
Q3. Create a Pandas DataFrame that contains the following data:

import lxml
import pandas as pd

df = pd.read_csv("student.csv")
type(df)

Name 	Age 	Gender
0 	Alice 	25 	female
1 	Bob 	30 	male
2 	Arnold 	27 	female

''' Q4

A Pandas DataFrame is a 2 dimensional data structure, like a 2 dimensional array, or a table with rows and columns
import pandas as pd

fruits = [ "apple" ,"orange" ,"jackfruit" ]
ftser1 = pd.Series(fruits, index=[11,33,88])
type(ftser1)
print(ftser1)
print("")
states = ["jammu" ,"maharastra", "bihar"]
stser1 = pd.Series(states)
type(states)
print(stser1)


A pandas series is a one-dimensional data structure that comprises of key-value pair, where keys/labels are the indices and values are the values stored on that index. It is similar to a python dictionary, except it provides more freedom to manipulate and edit the data.

fruits_jack = ["apples", "oranges", "bananas"]
fruits_john = ["guavas", "kiwis", "strawberries"]

all_fruits = { "jack_fruit" : fruits_jack, 
               "john_fruit" : fruits_john  }

new_fruit = pd.DataFrame(all_fruits)
type(new_fruit)
print(new_fruit)
'''

''' Q5

import pandas as pd
import numpy as np
technologies   = {
    'Courses':["Spark","PySpark","Hadoop","Python","Pandas",None,"Spark","Python"],
    'Fee' :[22000,25000,23000,24000,np.nan,25000,25000,22000],
    'Duration':['30day','50days','55days','40days','60days','35day','','50days'],
    'Discount':[1000,2300,1000,1200,2500,1300,1400,1600]
          }
row_labels=['r0','r1','r2','r3','r4','r5','r6','r7']
#df = pd.DataFrame(technologies, index=row_labels)
df = pd.DataFrame(technologies)
print(df)
print(type(df))
df['Discount'] = df['Discount'] - 500
df
df2 = df[6:]
df2
df.drop(df.index[2:])
df1=df.drop(0)
df1
'''''

''' Q6
Pandas deals with the following three data structures −
	Series
	DataFrame
	Panel
Series 		:1 1D labeled homogeneous array, size immutable.
Data Frames	: 2 General 2D labeled, size-mutable tabular structure with potentially heterogeneously typed columns.
Panel		: 3 General 3D labeled, size-mutable array.
'''

''' Q7
You can create a DataFrame from multiple Series objects by adding each series as a columns. 
By using concat() method you can merge multiple series together into DataFrame. 

import pandas as pd

courses = pd.Series(['Spark','PySpark','Hadoop'])
fees = pd.Series([22000,23000,24000])
discount = pd.Series([1000,2300,2400])

df = pd.concat([courses,fees,discount],axis=1)
df
type(df)
'''

SyntaxError: invalid syntax (344161491.py, line 29)